[
  {
    "id": "blog001",
    "title": "So This Is a Blog Now",
    "subtitle": "building in public, kind of",
    "description": "An introduction, some context, and why this site exists",
    "author": "BlankLabs",
    "date": "2026-02-05",
    "blocks": [
      {
        "type": "text",
        "format": "paragraph",
        "content": "I’ve been sitting on the idea of making a real website for a while now. Not just a landing page or something that says “under construction,” but an actual place where I can put thoughts, projects, and progress. This is me finally committing to that."
      },
      {
        "type": "text",
        "format": "paragraph",
        "content": "This blog is part experiment, part journal, and part archive. I like learning how things work behind the scenes, especially with tech and cybersecurity, and I wanted a space where I can document that without worrying about making everything perfect."
      },
      {
        "type": "text",
        "format": "paragraph",
        "content": "A lot of what I do starts with curiosity. I’ll see something online and think, “how does that actually work?” and then I’ll dig into it until I either understand it or accidentally break something. Most of the time it’s both."
      },
      {
        "type": "text",
        "format": "paragraph",
        "content": "BlankLabs is basically the result of that mindset. It’s a place for experiments, half-formed ideas, small wins, mistakes, and things I find interesting. Some posts might be technical, some might be more reflective, and some might just be me rambling about what I’m building that week."
      },
      {
        "type": "image",
        "src": "logo.png",
        "caption": "Keeping it simple for now"
      },
      {
        "type": "text",
        "format": "paragraph",
        "content": "I’m also using this site as motivation to actually finish things. When projects live only on my computer, it’s easy to abandon them. Putting them here makes them feel more real, like they deserve to be completed and documented."
      },
      {
        "type": "text",
        "format": "paragraph",
        "content": "This isn’t meant to be polished or corporate. I want it to feel honest. If something doesn’t work, I’ll probably write about that too. Learning in public is a little uncomfortable, but it’s also the fastest way I’ve found to improve."
      },
      {
        "type": "text",
        "format": "paragraph",
        "content": "If you’re reading this at some point in the future, just know this is the very beginning. The layout will change, features will come and go, and the content will evolve as I do. That’s kind of the point."
      },
      {
        "type": "text",
        "format": "paragraph",
        "content": "For now, this first post is just a marker. Proof that I started. Everything after this is progress, even if it’s messy."
      }
    ]
  }
]
